In [53]:
import warnings
warnings.filterwarnings("ignore", message="pandas only supports SQLAlchemy connectable*")
warnings.filterwarnings("default")

In [17]:
%pip install pyodbc
import subprocess
import pandas as pd
import pyodbc

In [4]:
docker_compose_file = 'docker-compose.yml'

try:
    comando = f'docker-compose -f {docker_compose_file} up -d'

    resultado = subprocess.run(comando, shell=True, check=True)
    print("Docker Compose se ejecutó exitosamente, espere 15 seg")
except subprocess.CalledProcessError as e:
    print(f"Error al ejecutar Docker Compose: {e}")
except Exception as e:
    print(f"Error inesperado: {e}")

Docker Compose se ejecutó exitosamente.

In [52]:
server = 'localhost'
database = 'EMPRESA'
username = 'SA'
password = 'XyZ#2fL9!qo$7aB'
conn_str = f'DRIVER=SQL Server;SERVER={server};DATABASE={database};UID={username};PWD={password}'
conn = pyodbc.connect(conn_str)

vistas = ['PREGUNTA_1', 
          'PREGUNTA_2', 
          'PREGUNTA_3', 
          'PREGUNTA_4', 
          'PREGUNTA_5', 
          'PREGUNTA_6', 
          'PREGUNTA_7', 
          'PREGUNTA_8', 
          'PREGUNTA_9']

Respuestas = {}
for vista in vistas:
    query = f'SELECT * FROM {vista}'
    Respuestas[vista] = pd.read_sql_query(query, conn)
conn.close()

C:\Users\braya\AppData\Local\Temp\ipykernel_19884\1424838540.py:21: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  Respuestas[vista] = pd.read_sql_query(query, conn)

Punto 1
➢ Seleccione nombre, apellido y salario de todos los empleados.

In [47]:
Respuestas['PREGUNTA_1']

      NOMBRE  APELLIDO    SALARIO
0       JUAN    PELAEZ  3500000.0
1     ANDRES    GARCIA  5500000.0
2      LAURA     PEREZ  2500000.0
3       PEPE  MARTINEZ  3800000.0
4  MARGARITA  CORRALES  4500000.0

➢ Seleccione nombre, apellido y salario de todos los empleados que ganen más 
de 4 millones.

In [35]:
Respuestas['PREGUNTA_2']

      NOMBRE  APELLIDO    SALARIO
0     ANDRES    GARCIA  5500000.0
1  MARGARITA  CORRALES  4500000.0

➢ Cuente los empleados por sexo.

In [36]:
Respuestas['PREGUNTA_3']

  SEXO  TOTAL
0    F      2
1    M      3

➢ Seleccione los empleados que no han hecho solicitud de vacaciones.

In [37]:
Respuestas['PREGUNTA_4']

      NOMBRE  APELLIDO  ID_EMP
0       PEPE  MARTINEZ       4
1  MARGARITA  CORRALES       5

➢ Seleccione los empleados que tengan más de una solicitud de vacaciones y 
muestre cuantas solicitudes tienen los que cumplen.

In [38]:
Respuestas['PREGUNTA_5']

   NOMBRE APELLIDO  ID_EMP  CantidadSolicitudes
0  ANDRES   GARCIA       2                    3
1   LAURA    PEREZ       3                    2

➢ Determine el salario promedio de los empleados.

In [39]:
Respuestas['PREGUNTA_6']

   SALARIO_PROMEDIO
0         3960000.0

➢ Determine la cantidad de días promedio solicitados de vacaciones por cada 
empleado.

In [40]:
Respuestas['PREGUNTA_7']

   ID     NOMBRE  APELLIDO  DIAS
0   1       JUAN    PELAEZ  14.0
1   2     ANDRES    GARCIA  11.0
2   3      LAURA     PEREZ   8.0
3   4       PEPE  MARTINEZ   NaN
4   5  MARGARITA  CORRALES   NaN

➢ Seleccione el empleado que mayor cantidad de días de vacaciones ha 
solicitado, muestre el nombre, apellido y cantidad de días totales solicitados.

In [41]:
Respuestas['PREGUNTA_8']

   NOMBRE APELLIDO  DIAS
0  ANDRES   GARCIA    34

➢ Consulte la cantidad de días aprobados y rechazados por cada empleado, 
en caso de no tener solicitudes mostrar 0.

In [42]:
Respuestas['PREGUNTA_9']

      NOMBRE  APELLIDO  APROBADOS  RECHAZADOS
0       JUAN    PELAEZ         14           0
1     ANDRES    GARCIA         20          14
2      LAURA     PEREZ         16           0
3       PEPE  MARTINEZ          0           0
4  MARGARITA  CORRALES          0           0